&НаКлиенте
Процедура РассчитатьСумму()
	Если ЗначениеЗаполнено(Объект.ТипБилета) И Объект.КоличествоБилетов > 0 Тогда
		ДанныеТипаБилета = ПолучитьДанныеТипаБилета(Объект.ТипБилета);
		Если ДанныеТипаБилета.КатегорияБилета = "ЗаБилет" Тогда
			Объект.Сумма = Объект.КоличествоБилетов * ДанныеТипаБилета.Цена;
		ИначеЕсли ДанныеТипаБилета.КатегорияБилета = "Пакет" Или ДанныеТипаБилета.КатегорияБилета = "Абонемент" Тогда
			Объект.Сумма = ДанныеТипаБилета.Цена;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТипаБилета(ТипБилета)
	Данные = Новый Структура("КатегорияБилета, Цена");
	Данные.КатегорияБилета = ТипБилета.КатегорияБилета;
	Данные.Цена = ТипБилета.Цена;
	Возврат Данные;
КонецФункции

&НаКлиенте
Процедура ТипБилетаПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоБилетовПриИзменении(Элемент)
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура НачалоСеансаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Фильм) И ЗначениеЗаполнено(Объект.НачалоСеанса) Тогда
		Объект.ОкончаниеСеанса = Объект.НачалоСеанса + Объект.Фильм.Продолжительность * 60;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФильмПриИзменении(Элемент)
	НачалоСеансаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеСеансаПриИзменении(Элемент)
КонецПроцедуры
