Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Если СтрокаТЧ.Кинозал.Состояние = Перечисления.СостоянияЗалов.Работает Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Кинозал """ + Строка(СтрокаТЧ.Кинозал) + """ уже числится работающим!";
			Сообщение.Поле = "Кинозалы[" + (СтрокаТЧ.НомерСтроки - 1) + "].Кинозал";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Движение = Движения.ИсторияСтатусовЗалов.Добавить();
		Движение.Период = Дата;
		Движение.Кинозал = СтрокаТЧ.Кинозал;
		Движение.Статус = Перечисления.СтатусыЗалов.Свободен;
		
		ДвижениеБух = Движения.Проводки.Добавить();
		ДвижениеБух.Период = Дата;
		ДвижениеБух.СчетДт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.СчетКт = ПланыСчетов.Управленческий.Касса;
		ДвижениеБух.Сумма = -СтрокаТЧ.Стоимость;
		
		ЗалОбъект = СтрокаТЧ.Кинозал.ПолучитьОбъект();
		ЗалОбъект.СтоимостьЗакупки = СтрокаТЧ.Стоимость;
		ЗалОбъект.Состояние = Перечисления.СостоянияЗалов.Работает;
		ЗалОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
