Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Если СтрокаТЧ.Кинозал.Состояние = Перечисления.СостоянияЗалов.Закрыт Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Кинозал """ + Строка(СтрокаТЧ.Кинозал) + """ уже закрыт!";
			Сообщение.Поле = "Кинозалы[" + (СтрокаТЧ.НомерСтроки - 1) + "].Кинозал";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого СтрокаТЧ Из Кинозалы Цикл
		Движение = Движения.ИсторияСтатусовЗалов.Добавить();
		Движение.Период = Дата;
		Движение.Кинозал = СтрокаТЧ.Кинозал;
		Движение.Статус = Перечисления.СтатусыЗалов.Закрыт;
		
		ЗалОбъект = СтрокаТЧ.Кинозал.ПолучитьОбъект();
		ЗалОбъект.Состояние = Перечисления.СостоянияЗалов.Закрыт;
		ЗалОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
