Процедура ОбработкаПроведения(Отказ, Режим)
	Движение = Движения.Проводки.Добавить();
	Движение.Период = Дата;
	Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
	Движение.СчетКт = ПланыСчетов.Управленческий.Взаиморасчеты;
	Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Клиенты] = Клиент;
	Движение.Сумма = Сумма;
	
	// Завершение задачи «Оплата билетов»
	ЗапросЗадачи = Новый Запрос;
	ЗапросЗадачи.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаИсполнителя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя
		|ГДЕ
		|	ЗадачаИсполнителя.ТочкаМаршрута = ЗНАЧЕНИЕ(БизнесПроцесс.ОбслуживаниеПосетителя.ТочкаМаршрута.ОплатаБилетов)
		|	И ЗадачаИсполнителя.БизнесПроцесс.Клиент = &Клиент
		|	И ЗадачаИсполнителя.Выполнена = ЛОЖЬ";
	ЗапросЗадачи.УстановитьПараметр("Клиент", Клиент);
	РезультатЗадачи = ЗапросЗадачи.Выполнить();
	Если Не РезультатЗадачи.Пустой() Тогда
		ВыборкаЗадачи = РезультатЗадачи.Выбрать();
		Пока ВыборкаЗадачи.Следующий() Цикл
			ЗадачаОбъект = ВыборкаЗадачи.Ссылка.ПолучитьОбъект();
			ЗадачаОбъект.ВыполнитьЗадачу();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры