Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаБроньБилетов") Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		Кинозал = ДанныеЗаполнения.Кинозал;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЗначениеЗаполнено(ВедущаяЗадача) Тогда
		Заказ = ВедущаяЗадача.Основание;
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказВБар") Тогда
			Если Не ЗначениеЗаполнено(Клиент) Тогда
				Клиент = Заказ.Клиент;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Кинозал) Тогда
				Кинозал = Заказ.Кинозал;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
